data integrity check

Connect to the database:

In [1]:
import pandas as pd
import sqlite3
con = sqlite3.connect("data/db/food_inspections.db")

In [2]:
facility_test = pd.read_sql_query('select * from facility limit 5;', con)
facility_test

,id,name_dba,name_aka,license_id,facility_type,address,zip
0,0,#1 CHINA EXPRESS LTD,#1 CHINA EXPRESS LTD,1869616,restaurant,4248 S WENTWORTH AVE,60609
1,1,#1 CHOP SUEY,#1 CHOP SUEY,2042372,restaurant,1907 W 87TH ST,
2,2,#1 CHOP SUEY,#1 CHOP SUEY,1970042,restaurant,4307 W IRVING PARK RD,60641
3,3,#1 CHOP SUEY RESTAURANT,#1 CHOP SUEY RESTAURANT,1739799,restaurant,4307 W IRVING PARK RD,60641
4,4,#1 DELI INC,31 DELI INC,2501188,grocery,6901 S NORMAL BLVD,60621

In [3]:
address_test = pd.read_sql_query('select * from address limit 5;', con)
address_test

                     street    zip     city state   latitude  longitude
0        2121 S PRAIRIE AVE  60616  CHICAGO    IL  41.853651 -87.620534
1         1025 W MADISON ST  60607  CHICAGO    IL  41.881572 -87.653052
2          301 N JUSTINE ST  60607  CHICAGO    IL  41.886577 -87.665328
3       2245 N MCVICKER AVE  60639  CHICAGO    IL  41.921675 -87.776711
4  4355 S COTTAGE GROVE AVE  60653  CHICAGO    IL  41.815197 -87.606531

In [4]:
risk_test = pd.read_sql_query('select * from risk limit 5;', con)
risk_test

  code   level
0    0     All
1    1    High
2    2  Medium
3    3     Low

In [5]:
facility_risk_test = pd.read_sql_query('select * from facility_risk limit 5;', con)
facility_risk_test

  facility_id risk_code
0           0         1
1           1         1
2           2         1
3           3         1
4           4         2

In [6]:
inspection_test = pd.read_sql_query('select * from inspection limit 5;', con)
inspection_test

      id        date                   type result
0  67732  2010-01-04  license re-inspection   Pass
1  67733  2010-01-04  license re-inspection   Pass
2  52234  2010-01-04  license re-inspection   Pass
3  67757  2010-01-04            tag removal   Pass
4  70269  2010-01-04  license re-inspection   Pass

In [7]:
facility_inspection_test = pd.read_sql_query('select * from facility_inspection limit 5;', con)
facility_inspection_test

  facility_id inspection_id
0           0        467259
1           0       1285263
2           1       1296904
3           1       1395782
4           1        277104

In [8]:
violation_test = pd.read_sql_query('select * from violation limit 5;', con)
violation_test

  code                                        description
0    1  SOURCE SOUND CONDITION, NO SPOILAGE, FOODS PRO...
1    2          FACILITIES TO MAINTAIN PROPER TEMPERATURE
2    3  POTENTIALLY HAZARDOUS FOOD MEETS TEMPERATURE R...
3    4  SOURCE OF CROSS CONTAMINATION CONTROLLED I.E. ...
4    5  PERSONNEL WITH INFECTIONS RESTRICTED: NO OPEN ...

In [9]:
inspection_violation_test = pd.read_sql_query('select * from inspection_violation limit 5;', con)
inspection_violation_test

,inspection_id,violation_code,violation_comment
0,44247,30,All food not stored in the original container ...
1,44247,32,OBSERVED TORN DOOR GASKET ON DOOR OF 'CHILL IS...
2,44247,33,All food and non-food contact surfaces of equi...
3,44247,34,"The floors shall be constructed per code, be s..."
4,44247,37,Toilet rooms shall be completely enclosed and ...